stemChamber/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          800;
        startFace       34300;
    }
    left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       35100;
    }
    right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       35400;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          800;
        startFace       35700;
    }
    front
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          600;
        startFace       36500;
    }
    back
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          600;
        startFace       37100;
    }
)

// ************************************************************************* //
